In [1]:
import numpy as np
import pandas as pd
import keras
import keras.backend as K
from keras.optimizers import Adam
from keras.models import Sequential
from keras.utils import Sequence
from keras.layers import *
import matplotlib.pyplot as plt
from google.colab import files
import io 
from google.colab import drive

from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_squared_error
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor

pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [2]:
drive.mount("/content/drive", force_remount=True)

Mounted at /content/drive

In [3]:
path_1 = "/content/drive/MyDrive/Projects 2021/Open Asteroid Dataset/Asteroid.csv"
df_asteroid = pd.read_csv(path_1)
path_2 = "/content/drive/MyDrive/Projects 2021/Open Asteroid Dataset/Asteroid_Updated.csv"
df_asteroid_up = pd.read_csv(path_2)

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (11,14,15,22,23) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0,10,15,16,23,24) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
df_asteroid.head()

        full_name         a         e     G          i          om           w         q        ad     per_y  data_arc condition_code  n_obs_used     H diameter                 extent  albedo    rot_per       GM     BV     UB  IR spec_B spec_T neo pha     moid
0         1 Ceres  2.769165  0.076009  0.12  10.594067   80.305532   73.597694  2.558684  2.979647  4.608202    8822.0              0        1002  3.34    939.4  964.4 x 964.2 x 891.8  0.0900   9.074170  62.6284  0.713  0.426 NaN      C      G   N   N  1.59478
1        2 Pallas  2.772466  0.230337  0.11  34.836234  173.080063  310.048857  2.133865  3.411067  4.616444   72318.0              0        8490  4.13      545            582x556x500  0.1010   7.813200  14.3000  0.635  0.284 NaN      B      B   N   N  1.23324
2          3 Juno  2.669150  0.256942  0.32  12.988919  169.852760  248.138626  1.983332  3.354967  4.360814   72684.0              0        7104  5.33  246.596                    NaN  0.2140   7.210000      NaN  0.824  0.433 NaN     Sk      S   N   N  1.03454
3         4 Vesta  2.361418  0.088721  0.32   7.141771  103.810804  150.728541  2.151909  2.570926  3.628837   24288.0              0        9325  3.20    525.4  572.6 x 557.2 x 446.4  0.4228   5.342128  17.8000  0.782  0.492 NaN      V      V   N   N  1.13948
4       5 Astraea  2.574249  0.191095   NaN   5.366988  141.576604  358.687608  2.082324  3.066174  4.130323   63431.0              0        2861  6.85  106.699                    NaN  0.2740  16.806000      NaN  0.826  0.411 NaN      S      S   N   N  1.09589

In [5]:
df_asteroid_up.head()

      name         a         e          i          om           w         q        ad     per_y  data_arc condition_code  n_obs_used     H neo pha diameter                 extent  albedo    rot_per       GM     BV     UB  IR spec_B spec_T     G     moid class         n          per          ma
0    Ceres  2.769165  0.076009  10.594067   80.305532   73.597694  2.558684  2.979647  4.608202    8822.0              0        1002  3.34   N   N    939.4  964.4 x 964.2 x 891.8  0.0900   9.074170  62.6284  0.713  0.426 NaN      C      G  0.12  1.59478   MBA  0.213885  1683.145708   77.372096
1   Pallas  2.772466  0.230337  34.836234  173.080063  310.048857  2.133865  3.411067  4.616444   72318.0              0        8490  4.13   N   N      545            582x556x500  0.1010   7.813200  14.3000  0.635  0.284 NaN      B      B  0.11  1.23324   MBA  0.213503  1686.155999   59.699133
2     Juno  2.669150  0.256942  12.988919  169.852760  248.138626  1.983332  3.354967  4.360814   72684.0              0        7104  5.33   N   N  246.596                    NaN  0.2140   7.210000      NaN  0.824  0.433 NaN     Sk      S  0.32  1.03454   MBA  0.226019  1592.787285   34.925016
3    Vesta  2.361418  0.088721   7.141771  103.810804  150.728541  2.151909  2.570926  3.628837   24288.0              0        9325  3.20   N   N    525.4  572.6 x 557.2 x 446.4  0.4228   5.342128  17.8000  0.782  0.492 NaN      V      V  0.32  1.13948   MBA  0.271609  1325.432765   95.861936
4  Astraea  2.574249  0.191095   5.366988  141.576605  358.687607  2.082324  3.066174  4.130323   63507.0              0        2916  6.85   N   N  106.699                    NaN  0.2740  16.806000      NaN  0.826  0.411 NaN      S      S   NaN  1.09589   MBA  0.238632  1508.600458  282.366289